<?php
//первый вариант
$x = 10;
$y = 20;
echo "До обмена: x = $x, y = $y\n";

$tmp = $x;
$x = $y;
$y = $tmp;

echo "После обмена: x = $x, y = $y\n";


//Второй вариант
$a = 10;
$b = 20;

echo "До обмена: a = $a, b = $b\n";

[$a, $b] = [$b, $a];

echo "После обмена: a = $a, b = $b\n";

$x = 1;
$y = 2;

$x = $x + $y; // 1 + 2 = 3
$y = $x - $y; // 3 - 2 = 1
$x = $x - $y; // 3 - 1 = 2

$x = $x + $y - $y = $x;

$x ^= $y ^= $x ^= $y;
$x = $x ^ $y ^ $y = $x;

$x += +$y - $y = $x;

[$x, $y] = [$y, $x]; //7.1

list($y, $x) = [$x, $y];

$x = [$y, $y = $x][0];

echo "x = {$x}, y = {$y}";